Project/todo list for the Book In Question

** DONE Wrap post w/ just the catalog?            :curweek:
CLOSED: [2025-10-30 Thu 11:09]
:LOGBOOK:
CLOCK: [2025-10-30 Thu 09:13]--[2025-10-30 Thu 11:09] =>  1:56
CLOCK: [2025-10-29 Wed 09:40]--[2025-10-29 Wed 11:48] =>  2:08
CLOCK: [2025-10-28 Tue 13:52]--[2025-10-28 Tue 15:05] =>  1:13
CLOCK: [2025-10-28 Tue 10:16]--[2025-10-28 Tue 11:15] =>  0:59
CLOCK: [2025-10-28 Tue 08:28]--[2025-10-28 Tue 09:00] =>  0:32
CLOCK: [2025-10-25 Sat 08:59]--[2025-10-25 Sat 08:59] =>  0:00
CLOCK: [2025-10-24 Fri 15:56]--[2025-10-24 Fri 16:21] =>  0:25
:END:
** DONE Bring to life challenge of making request :curweek:
CLOSED: [2025-10-28 Tue 11:15]
:LOGBOOK:
CLOCK: [2025-10-26 Sun 16:57]--[2025-10-26 Sun 17:20] =>  0:23
CLOCK: [2025-10-26 Sun 09:02]--[2025-10-26 Sun 10:30] =>  1:28
:END:


Really, it's not specifically the story, it's making the idea feel like a full idea, instead of just dropping the reader into the tactics so abruptly.

Maybe explain *why* to go through that three part arc. Stakeholders are going to hear anything as a threat. They generally feel alone in pursuing their major goal, and alone in facing their own biggest fears.

Therefore, if you can calmly and authentically demonstrate that you understand and care about their goals and their problems, they will exhale, and be much more ready to listen to you.

Then, you can lay out your concerns, carefully doing so in a non-judgmental fashion.

At that point, you can draw your stakeholder into a collaborative problem solving session by offering a possible solution.

It's much easier to do this in small increments than as one big step -- that allows you to build trust as you to.
** DONE Grab/integrate Compelling Offer>Substack  :curweek:
CLOSED: [2025-10-31 Fri 11:13]
:LOGBOOK:
CLOCK: [2025-10-31 Fri 09:12]--[2025-10-31 Fri 11:13] =>  2:01
:END:
** DONE Chunk out work to get to Beta             :curweek:
CLOSED: [2025-10-31 Fri 08:53]
:LOGBOOK:
CLOCK: [2025-10-31 Fri 08:17]--[2025-10-31 Fri 08:53] =>  0:36
:END:
** DONE Decide a target date                      :curweek:
CLOSED: [2025-10-31 Fri 09:02]
:LOGBOOK:
CLOCK: [2025-10-31 Fri 08:53]--[2025-10-31 Fri 09:02] =>  0:09
:END:
** DONE Make target visible                       :curweek:
CLOSED: [2025-10-31 Fri 09:12]
:LOGBOOK:
CLOCK: [2025-10-31 Fri 09:02]--[2025-10-31 Fri 09:12] =>  0:10
:END:
Up on the wall?

Maybe have a burndown? Use claude to visualize?

Visible on the wall and/or in org?
** TODO Write "How To Deliver Offer"
:LOGBOOK:
CLOCK: [2025-10-20 Mon 16:52]--[2025-10-20 Mon 16:52] =>  0:00
:END:
** DONE Make it Good Enough For Now
CLOSED: [2025-10-23 Thu 11:09]
:LOGBOOK:
CLOCK: [2025-10-23 Thu 08:50]--[2025-10-23 Thu 11:09] =>  2:19
CLOCK: [2025-10-22 Wed 08:41]--[2025-10-22 Wed 11:57] =>  3:16
CLOCK: [2025-10-21 Tue 09:43]--[2025-10-21 Tue 11:40] =>  1:57
CLOCK: [2025-10-20 Mon 16:52]--[2025-10-20 Mon 17:40] =>  0:48
CLOCK: [2025-10-20 Mon 15:59]--[2025-10-20 Mon 16:07] =>  0:08
CLOCK: [2025-10-20 Mon 10:15]--[2025-10-20 Mon 12:31] =>  2:16
:END:
I'm aiming for an MVP, remember. For people who really want this, and need it. Gotta find out that bad news sooner than later.  Yeah, that list of tactics is kind of gold? And the narratives might be an inconsistent mess, but so what? This is the crappy UI that still works.
** DONE Keep revising/restructuring
CLOSED: [2025-10-20 Mon 09:56]
:LOGBOOK:
CLOCK: [2025-10-19 Sun 10:01]--[2025-10-19 Sun 11:38] =>  1:37
CLOCK: [2025-10-19 Sun 07:53]--[2025-10-19 Sun 09:03] =>  1:10
CLOCK: [2025-10-18 Sat 08:40]--[2025-10-18 Sat 10:20] =>  1:40
CLOCK: [2025-10-16 Thu 14:31]--[2025-10-16 Thu 16:05] =>  1:34
CLOCK: [2025-10-16 Thu 08:39]--[2025-10-16 Thu 10:59] =>  2:20
CLOCK: [2025-10-15 Wed 08:47]--[2025-10-15 Wed 10:48] =>  2:01
CLOCK: [2025-10-14 Tue 20:13]--[2025-10-14 Tue 20:33] =>  0:20
CLOCK: [2025-10-14 Tue 17:11]--[2025-10-14 Tue 17:44] =>  0:33
CLOCK: [2025-10-14 Tue 09:00]--[2025-10-14 Tue 11:24] =>  2:24
CLOCK: [2025-10-13 Mon 16:24]--[2025-10-13 Mon 16:54] =>  0:30
CLOCK: [2025-10-12 Sun 09:11]--[2025-10-12 Sun 10:44] =>  1:33
CLOCK: [2025-10-11 Sat 18:58]--[2025-10-11 Sat 19:23] =>  0:25
CLOCK: [2025-10-11 Sat 17:23]--[2025-10-11 Sat 18:01] =>  0:38
CLOCK: [2025-10-11 Sat 16:10]--[2025-10-11 Sat 17:17] =>  1:07
:END:

** DONE Draft learning outcomes/structure
CLOSED: [2025-09-14 Sun 14:57]
:LOGBOOK:
CLOCK: [2025-09-14 Sun 14:15]--[2025-09-14 Sun 14:57] =>  0:42
:END:
** DONE Bad first draft Strategic Intent
CLOSED: [2025-09-19 Fri 10:29]
:LOGBOOK:
CLOCK: [2025-09-19 Fri 10:01]--[2025-09-19 Fri 10:29] =>  0:28
CLOCK: [2025-09-19 Fri 07:08]--[2025-09-19 Fri 08:55] =>  1:47
CLOCK: [2025-09-18 Thu 16:42]--[2025-09-18 Thu 17:04] =>  0:22
CLOCK: [2025-09-17 Wed 11:39]--[2025-09-17 Wed 11:40] =>  0:01
CLOCK: [2025-09-17 Wed 09:23]--[2025-09-17 Wed 10:53] =>  1:30
CLOCK: [2025-09-16 Tue 08:31]--[2025-09-16 Tue 11:07] =>  2:36
:END:
** DONE Write bad version: Offer Labeled Feelings
CLOSED: [2025-09-22 Mon 10:38]
:LOGBOOK:
CLOCK: [2025-09-22 Mon 10:02]--[2025-09-22 Mon 10:38] =>  0:36
:END:
** DONE Write crappy "Putting it all together"    :pom:
CLOSED: [2025-09-24 Wed 10:20]
:LOGBOOK:
CLOCK: [2025-09-24 Wed 08:27]--[2025-09-24 Wed 10:19] =>  1:52
CLOCK: [2025-09-23 Tue 10:23]--[2025-09-23 Tue 10:45] =>  0:22
CLOCK: [2025-09-23 Tue 08:30]--[2025-09-23 Tue 09:51] =>  1:21
:END:
** DONE Finish exercises
CLOSED: [2025-09-25 Thu 11:44]
:LOGBOOK:
CLOCK: [2025-09-25 Thu 09:17]--[2025-09-25 Thu 11:44] =>  2:27
CLOCK: [2025-09-24 Wed 11:51]--[2025-09-24 Wed 12:01] =>  0:10
:END:
** DONE Work on more of fears & dreams
CLOSED: [2025-09-21 Sun 09:22]
:LOGBOOK:
CLOCK: [2025-09-21 Sun 08:15]--[2025-09-21 Sun 09:22] =>  1:07
:END:
** DONE Bad first draft Mine for Context
CLOSED: [2025-09-20 Sat 11:41]
:LOGBOOK:
CLOCK: [2025-09-20 Sat 09:13]--[2025-09-20 Sat 11:41] =>  2:28
:END:
** DONE Keep pawing away, maybe start writing
CLOSED: [2025-09-15 Mon 09:35]
:LOGBOOK:
CLOCK: [2025-09-14 Sun 09:08]--[2025-09-14 Sun 09:16] =>  0:08
:END:
*** DONE Write 2 more problems
CLOSED: [2025-08-11 Mon 11:21]
:LOGBOOK:
CLOCK: [2025-08-11 Mon 10:06]--[2025-08-11 Mon 11:21] =>  1:15
:END:
